SetEntity Method
 Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public void SetEntity(
	Entity entity
)
Visual Basic
Public Sub SetEntity ( _
	entity As Entity _
)
Visual C++
public:
void SetEntity(
	Entity^ entity
)
Parameters
entity
Type: Autodesk.Revit.DB.ExtensibleStorageEntity
 The Entity to be stored.
Exceptions
Exception | Condition
Autodesk.Revit.ExceptionsArgumentException |  Writing of Entities of this Schema is not allowed to the current add-in.
Autodesk.Revit.ExceptionsArgumentNullException |  A non-optional argument was null
See Also
Element Class
Autodesk.Revit.DB Namespace
 ArchiLabs
Stop fighting Revit automation.
Build repeatable BIM design and documentation workflows with scripts, data, and AI in one place, without wrestling brittle one-off automations.
 Try ArchiLabs →